Autodesk.Revit.DB.WallTypeSet
A set that contains wall types.

Autodesk.Revit.DB.WallTypeSet.Insert(Autodesk.Revit.DB.WallType)
System.Int32
Insert the specified wall type into the set.
item: The wall type to be inserted into the set.
Returns: Returns whether the wall type was inserted into the set.

Autodesk.Revit.DB.WallTypeSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.WallTypeSet.ReverseIterator
Autodesk.Revit.DB.WallTypeSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.WallTypeSet.ForwardIterator
Autodesk.Revit.DB.WallTypeSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.WallTypeSet.Erase(Autodesk.Revit.DB.WallType)
System.Int32
Removes a specified wall type from the set.
item: The wall type to be erased.
Returns: The number of wall types that were erased from the set.

Autodesk.Revit.DB.WallTypeSet.Contains(Autodesk.Revit.DB.WallType)
System.Boolean
Tests for the existence of a wall type within the set.
item: The wall type to be searched for.
Returns: The Contains method returns True if the wall type is within the set, otherwise False.

Autodesk.Revit.DB.WallTypeSet.Clear
void
Removes every wall type from the set, rendering it empty.

Autodesk.Revit.DB.WallTypeSet.Size
System.Int32
get
Returns the number of wall types that are in the set.

Autodesk.Revit.DB.WallTypeSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.